// var PI = 3.141592653;
//
// console.log(PI);
//
// PI = 3.5;   //不符合我们认知，因为π是个定值
// console.log(PI);
//----------------------------------------------------
// const PI = 3.141592653;   //定义PI常量
// PI = 3.5;    //报错

//----------------------------------------------------
const OBJ = {
    name: "nodejs",
    age:11,
    email:"nodejs@163.com"
};
//
// // OBJ = {};  //报错
//
OBJ.job = "nodejs@qq.com";  //可以修改成功
console.log(OBJ);   //{ name: 'nodejs', age: 11, email: 'nodejs@qq.com' }
//----------------------------------------------------

const ARR = [10, 0, 30];
ARR[1] = 20;
console.log(ARR);   //[ 10, 20, 30 ]

const A = 1;
//A = 2;  //报错

/*

1、const用来定义常量，修改就会报错
2、我们约定俗成地把常量都命名为大写
3、对象型常量中的属性可以修改
4、数组型常量中的每一项数据的引用可以修改

*/